{
    "choice": {
        "respect": "បាទ ខ្ញុំយល់ហើយខ្ញុំនឹងមិនធ្វើវាទេ។"
    },
    "questions": {
        "enter": "ចូរអ្នកបញ្ជូលលេខក្នុងចន្លោះ {range_min} និង {range_max}។",
        "~coding": "អញ្ចឹងយើងនឹងចាប់ផ្ដើមហើយ! ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តការសរសេរកូដប៉ុណ្ណាដែរ?",
        "~marketing": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្ត Marketing ប៉ុណ្ណាដែរ?",
        "~networking": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្ត Networking ដូចជា ការថែទាំ router និង BGP ប៉ុណ្ណាដែរ?",
        "~solve_problems": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តការដោះស្រាយបញ្ហាប៉ុណ្ណាដែរ?",
        "~math": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តគណិតវិទ្យាប៉ុណ្ណាដែរ?",
        "~physics": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តរូបវិទ្យាប៉ុណ្ណាដែរ?",
        "~soft_skills": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកឱ្យតម្លៃទៅលើ ជំនាញទន់ ប៉ុណ្ណាដែរ?",
        "~create_software": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តការបង្កើតកម្មវិធី Program កុំព្យូទ័រ ប៉ុណ្ណាដែរ?",
        "~create_content": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តការបង្កើត online content ដូចជា វីឌីអូ ប៉ាណូពាណិជ្ជកម្ម ប៉ុណ្ណាដែរ?",
        "~physical_networking": "ក្នុងចន្លោះពី 1 ដល់ 5 តើអ្នកចូលចិត្តការធ្វើការជាមួយនឹងបណ្តាញបច្ចេកទេសផ្ទាល់ ដូចជា ការដម្លើង server និង ភ្ជាប់ router ជាដើម ប៉ុណ្ណាដែរ?",
        "!code_dev": "ចូរអ្នកបញ្ជូលចម្លើយដោយប្រើលេខនៅពីមុខចម្លើយនោះ។ តើនៅពេលដែលអ្នកធ្វើការបង្កើតនូវកម្មវិធីកុំព្យូទ័រមួយ តើអ្នកចូលចិត្តធ្វើជាអ្នកសរសេរកូដផ្ទាល់ ឬក៏អ្នកចូលចិត្តធ្វើជាអ្នកបញ្ជា និងគ្រប់គ្រងទៅលើក្រុម?\n\n1. អ្នកសរសេរកូដផ្ទាល់\n2. អ្នកគ្រប់គ្រង\n3. ទាំងពីរ/អត់ដឹង",
        "!build_planning": "នៅពេលដែលអ្នកធ្វើការនៅលើគម្រោងការណាមួយ តើអ្នកចូលចិត្តបង្កើតនូវប្លង់គម្រោងការមុននិងពេលចាប់ផ្ដើមធ្វើ ឬក៏អ្នកចូលចិត្តធ្វើការបណ្ដើរ ហើយបន្ថែមទៅលើគម្រោងការបណ្ដើរ?\n\n1. បង្កើតនូវប្លង់គម្រោងការមុននិងពេលចាប់ផ្ដើមធ្វើ\n2. ធ្វើបណ្ដើរបន្ថែមបណ្ដើរ",
        "!coding_often": "តើអ្នកធ្វើការសរសេរកូដញឹកញាប់ប៉ុន្មានផង?\n\n1. ក្រោម 1 ដងក្នុង 1 ខែ\n2. ប្រហែល 1 ដងក្នុង 1 ខែ\n3. ប្រហែល 1 ដងក្នុង 1 សប្តាហ៍\n4. រាល់ថ្ងៃ",
        "score_calc": "បាទ ខ្ញុំបានគណនាពិន្ទុហើយ ហើយចំពោះវគ្គសិក្សាដែលខ្ញុំគឹតថាស័ក្ដិសមចំពោះអ្នកនោះគឺ: {fullname}!\n\nហើយនេះគឺជាពិន្ទុរបស់ខ្ញុំសម្រាប់វគ្គសិក្សានេះ៖\nCS: {cs_score}\nEC: {ec_score}\nTN: {tn_score}"
    },
    "courses": {
        "cs": "វិទ្យាសាស្ត្រកុំព្យូទ័រ",
        "ec": "ពាណិជ្ជកម្មអេឡិចត្រូនិច",
        "tn": "ទូរគមនាគមន៍ និងបណ្ដាញ"
    },
    "request_human": {
        "confim": "បាទ ខ្ញុំនឹងភ្ជាប់អ្នកទៅកាន់បុគ្គលិកវិទ្យាស្ថាន ចូរអ្នករង់ចាំាបន្ដិចបន្ដួច។ ហើយនៅក្នុងចន្លោះនេះ អ្នកក៏នៅតែអាចជជែកជាមួយខ្ញុំបានរហូតដល់បុគ្គលិកម្នាក់នឹងទាក់ទងមកកាន់អ្នកវិញផងដែរ។"
    },
    "feedback": {
        "type": "បាទ តើអ្នកចង់ផ្ញើមតិប្រភេទណាដែរ? (សូមជ្រើសរើសមួយ)\n\n1. បញ្ហាខុសណាមួយ\n2. មតិដើម្បីជម្រុញធ្វើឱ្យកម្មវិធីនេះកាន់តែល្អ",
        "bug": "បាទ សូមបញ្ជាក់បញ្ហារបស់អ្នកខាងក្រោម៖",
        "improvement": "បាទ សូមបញ្ជាក់ការបន្ថែមឬការកែប្រែដែលអ្នកចង់ប្រើប្រាស់ក្នុងកម្មវិធីនេះ៖",
        "invalid_type": "ខ្ញុំសូមទោសផង តែលេខដែលអ្នកបានបញ្ចូល មិនត្រឹមត្រូវជាមួយនឹងប្រភេទណាមួយទេ។",
        "database_failure": "ខ្ញុំសូមទោសផង ខ្ញុំមិនអាចភ្ជាប់ទៅកាន់មូលដ្ឋានទិន្នន័យបានទេ។ សូមព្យាយាមម្តងទៀតនៅពេលក្រោយ។",
        "thanks": "សូមអរគុណយ៉ាងជ្រាលជ្រៅរបស់មតិរបស់អ្នក!"
    }
}